# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [120]:
# import libraries here
# import sys
# !{sys.executable} -m pip install plotly
import plotly.express as px
import pandas as pd
import os

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [81]:
# your code here
os.getcwd()
temp_states = pd.read_csv('../Temp_states.csv')

#### Print `temp`.

In [32]:
# your code here
temp_states

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [17]:
# your code here
temp_states.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
Both city & state column are categorical values, temperature are numerical values.
"""

#### Select the rows where state is New York.

In [33]:
# your code here
temp_states = temp_states.set_index('State')
New_York = temp_states.loc['New York']
New_York

             City  Temperature
State
New York      NYC    19.444444
New York   Albany     9.444444
New York  Buffalo     3.333333

#### What is the average temperature of cities in New York?

In [34]:
# your code here
Avg_temp = sum(New_York['Temperature'])/len(New_York['Temperature'])
Avg_temp

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [59]:
# your code here
Min15 = temp_states.loc[temp_states['Temperature']>15,:]
Min15

                 City  Temperature
State
New York          NYC    19.444444
Connecticut  Hartford    17.222222
New Jersey     Treton    22.222222
New Jersey     Newark    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [60]:
# your code here
Min15 = Min15.reset_index()
Min15 = Min15[['City']]
Min15

       City
0       NYC
1  Hartford
2    Treton
3    Newark

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [74]:
# your code here
Min15 = temp_states.loc[temp_states['Temperature']>15,:]
Min15_Max20 = Min15.loc[Min15['Temperature']<20,:]
Min15_Max20 = Min15_Max20.reset_index()
Min15_Max20[['City']]

       City
0       NYC
1  Hartford

#### Find the mean and standard deviation of the temperature of each state.

In [126]:
# your code here
print(temp_states.groupby(['State']).mean())
print(temp_states.groupby(['State']).std())

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741
             Temperature
State
Connecticut     1.964186
New Jersey      1.571348
New York        8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [123]:
# your code here
employees = pd.read_csv('../Employee.csv')
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [89]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
All data is categorical except for Year & Salary.
"""

#### What's the average salary in this company?

In [90]:
# your code here
avg_sal = employees['Salary'].mean()
avg_sal

48.888888888888886

#### What's the highest salary?

In [92]:
# your code here
max_sal =employees['Salary'].max()
max_sal

70

#### What's the lowest salary?

In [94]:
# your code here
min_sal =employees['Salary'].min()
min_sal

30

#### Who are the employees with the lowest salary?

In [95]:
# your code here
employees.loc[employees['Salary']==30]

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [96]:
# your code here
employees.loc[employees['Name']=='David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [103]:
# your code here
employees.loc[employees['Name']=='David', 'Salary']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [104]:
# your code here
employees.loc[employees['Title']=='associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [ ]:
# Method 1
# your code here

In [ ]:
# Method 2
# your code here

#### Find the employees whose title is associate and whose salary is above 55.

In [108]:
# your code here
associate55 = employees.loc[(employees['Title']=='associate') & 
              (employees['Salary']>55)]
associate55

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [127]:
# your code here
employees.groupby(['Years']).mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [131]:
# your code here
employees.groupby(['Title']).mean()

           Years     Salary
Title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

####  Find the salary quartiles.

In [137]:
# your code here
import numpy as np
Q1 = np.quantile(employees['Salary'], .25)
Q2 = np.quantile(employees['Salary'], .50)
Q3 = np.quantile(employees['Salary'], .75)
Q4 = np.quantile(employees['Salary'], 1)
print("Q1",Q1,"Q2",Q2,"Q3",Q3,"Q4",Q4)

Q1 35.0 Q2 55.0 Q3 60.0 Q4 70

#### Is the mean salary different per gender?

In [138]:
# your code here
employees.groupby(['Gender']).mean()
#Yes it is

        Years  Salary
Gender
F         4.0    47.5
M         4.2    50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [156]:
# your code here
# df = employees.loc[(employees['Department']),(employees['Years']), (employees['Salary'])]
df = employees[['Department','Years','Salary']]
min_ = df.groupby(['Department']).min()
mean_ = df.groupby(['Department']).mean()
max_ = df.groupby(['Department']).max()
print("Min:",min_,"\n\n","Mean:",mean_,"\n\n","Max:",max_)

Min:             Years  Salary
Department
HR              2      30
IT              1      30
Sales           2      55

 Mean:                Years  Salary
Department
HR          4.666667   45.00
IT          4.500000   48.75
Sales       2.500000   55.00

 Max:             Years  Salary
Department
HR              8      70
IT              8      70
Sales           3      55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here